tests/load/reading-engine.load.yml
config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3000' }}"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN || 'test-token' }}"
  processor: "./helpers/reading-engine-helpers.js"
  variables:
    languages:
      - "en"
      - "es"
      - "fr"
      - "de"
      - "ja"
      - "ko"
      - "zh"
      - "pt"
      - "it"
      - "ru"
    difficulties:
      - "A1"
      - "A2"
      - "B1"
      - "B2"
      - "C1"
      - "C2"
    topics:
      - "travel"
      - "food"
      - "technology"
      - "culture"
      - "science"
      - "sports"
      - "music"
      - "history"
      - "nature"
      - "business"

scenarios:
  # ---- Resource CRUD flows ----

  - name: "Create reading resource"
    weight: 15
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Load Test Article {{ $now }}"
            language: "{{ $randomChoice('en', 'es', 'fr', 'de', 'ja', 'ko', 'zh', 'pt', 'it', 'ru') }}"
            difficulty: "{{ $randomChoice('A1', 'A2', 'B1', 'B2', 'C1', 'C2') }}"
            topic: "{{ $randomChoice('travel', 'food', 'technology', 'culture', 'science', 'sports', 'music', 'history', 'nature', 'business') }}"
            content_text: "This is a generated reading resource for load testing the LingQ Reading Engine. It contains sample text used to exercise the word tokenisation and reading progress tracking subsystems."
            source_url: "https://example.com/load-test-article"
            word_count: 34
          capture:
            - json: "$.id"
              as: "resource_id"
          expect:
            - statusCode: 201

  - name: "List resources with filters"
    weight: 15
    flow:
      - get:
          url: "/reading/resources?language={{ $randomChoice('en', 'es', 'fr', 'de', 'ja', 'ko', 'zh', 'pt', 'it', 'ru') }}&difficulty={{ $randomChoice('A1', 'A2', 'B1', 'B2', 'C1', 'C2') }}&limit=20&offset=0"
          expect:
            - statusCode: 200

  - name: "Get single resource"
    weight: 10
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Single Get Test {{ $now }}"
            language: "en"
            difficulty: "B1"
            topic: "technology"
            content_text: "A short article for single-resource retrieval testing."
            word_count: 8
          capture:
            - json: "$.id"
              as: "resource_id"
      - get:
          url: "/reading/resources/{{ resource_id }}"
          expect:
            - statusCode: 200

  - name: "Update resource"
    weight: 10
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Update Test Resource {{ $now }}"
            language: "en"
            difficulty: "A1"
            topic: "travel"
            content_text: "Initial content before update."
          capture:
            - json: "$.id"
              as: "resource_id"
      - put:
          url: "/reading/resources/{{ resource_id }}"
          json:
            title: "Updated Load Test Resource {{ $now }}"
            difficulty: "B2"
            topic: "culture"
          expect:
            - statusCode: 200

  - name: "Delete resource"
    weight: 5
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Delete Test Resource {{ $now }}"
            language: "en"
            difficulty: "A1"
            topic: "sports"
            content_text: "This resource will be deleted."
          capture:
            - json: "$.id"
              as: "resource_id"
      - delete:
          url: "/reading/resources/{{ resource_id }}"
          expect:
            - statusCode: 204

  # ---- Tokenisation flows ----

  - name: "Tokenise resource with Intl.Segmenter"
    weight: 15
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Tokenise Test {{ $now }}"
            language: "{{ $randomChoice('en', 'es', 'fr', 'de', 'ja') }}"
            difficulty: "B1"
            topic: "technology"
            content_text: "The quick brown fox jumps over the lazy dog. Artificial intelligence is transforming language learning and creating new opportunities for global communication."
            word_count: 24
          capture:
            - json: "$.id"
              as: "resource_id"
      - get:
          url: "/reading/resources/{{ resource_id }}/tokenise?lang={{ $randomChoice('en', 'es', 'fr', 'de', 'ja') }}"
          expect:
            - statusCode: 200

  # ---- Reading progress flows ----

  - name: "Get reading progress"
    weight: 10
    flow:
      - get:
          url: "/reading/progress"
          expect:
            - statusCode: 200

  - name: "Record reading session"
    weight: 10
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Session Record Test {{ $now }}"
            language: "en"
            difficulty: "A2"
            topic: "science"
            content_text: "Reading session progress tracking test content for the LingQ Reading Engine load test suite."
            word_count: 16
          capture:
            - json: "$.id"
              as: "resource_id"
      - post:
          url: "/reading/progress/session"
          json:
            resourceId: "{{ resource_id }}"
            wordsRead: "{{ $randomNumber(50, 500) }}"
            durationSeconds: "{{ $randomNumber(120, 1800) }}"
          expect:
            - statusCode: 200

  # ---- Cache admin flows ----

  - name: "Clear user cache"
    weight: 5
    flow:
      - delete:
          url: "/reading/cache/user"
          expect:
            - statusCode: 204

  # ---- Mixed read-heavy scenario (no resource creation) ----

  - name: "Browse resources (read-only)"
    weight: 5
    flow:
      - get:
          url: "/reading/resources?language={{ $randomChoice('en', 'es', 'fr', 'de', 'ja', 'ko', 'zh', 'pt', 'it', 'ru') }}&limit=10&offset={{ $randomNumber(0, 50) }}"
          expect:
            - statusCode: 200