tests/load/reading-engine.load.yml
config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3000' }}"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN || 'test-token' }}"
  processor: "./helpers/reading-engine-helpers.js"
  variables:
    languages:
      - "en"
      - "es"
      - "fr"
      - "de"
      - "ja"
      - "ko"
      - "zh"
      - "ar"
      - "pt"
      - "it"
    difficulties:
      - "beginner"
      - "intermediate"
      - "advanced"
    topics:
      - "travel"
      - "food"
      - "sports"
      - "technology"
      - "culture"
      - "music"
      - "science"
      - "history"

scenarios:
  # ---- Resource CRUD ----

  - name: "Create reading resource"
    weight: 15
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Load Test Article {{ $now }}"
            content: "This is a sample reading passage for load testing the LingQ reading engine. It contains multiple sentences designed to exercise the tokeniser and vocabulary lookups. The quick brown fox jumps over the lazy dog. Language learning is a journey that requires dedication and practice."
            language: "{{ $randomChoice('en', 'es', 'fr', 'de', 'ja', 'ko', 'zh', 'ar', 'pt', 'it') }}"
            difficulty: "{{ $randomChoice('beginner', 'intermediate', 'advanced') }}"
            topic: "{{ $randomChoice('travel', 'food', 'sports', 'technology', 'culture', 'music', 'science', 'history') }}"
          capture:
            - json: "$.id"
              as: "resource_id"
          expect:
            - statusCode: 201

  - name: "List reading resources (unfiltered)"
    weight: 10
    flow:
      - get:
          url: "/reading/resources"
          expect:
            - statusCode: 200

  - name: "List reading resources by language"
    weight: 10
    flow:
      - get:
          url: "/reading/resources?language={{ languages }}&limit=20"
          expect:
            - statusCode: 200

  - name: "List reading resources by difficulty"
    weight: 8
    flow:
      - get:
          url: "/reading/resources?difficulty={{ difficulties }}&limit=20"
          expect:
            - statusCode: 200

  - name: "List reading resources by topic"
    weight: 8
    flow:
      - get:
          url: "/reading/resources?topic={{ topics }}&limit=20"
          expect:
            - statusCode: 200

  - name: "Get single reading resource"
    weight: 10
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Fetch Target {{ $now }}"
            content: "Target resource for GET-by-id load testing. Reading is fundamental to language acquisition."
            language: "en"
            difficulty: "beginner"
            topic: "culture"
          capture:
            - json: "$.id"
              as: "resource_id"
      - get:
          url: "/reading/resources/{{ resource_id }}"
          expect:
            - statusCode: 200

  - name: "Update reading resource"
    weight: 5
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Update Target {{ $now }}"
            content: "Original content before update."
            language: "en"
          capture:
            - json: "$.id"
              as: "resource_id"
      - put:
          url: "/reading/resources/{{ resource_id }}"
          json:
            title: "Updated Article {{ $now }}"
            content: "Updated content for load testing the PATCH-equivalent PUT endpoint on reading resources."
            topic: "technology"
          expect:
            - statusCode: 200

  - name: "Delete reading resource"
    weight: 4
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Delete Target {{ $now }}"
            content: "This resource will be deleted."
            language: "en"
          capture:
            - json: "$.id"
              as: "resource_id"
      - delete:
          url: "/reading/resources/{{ resource_id }}"
          expect:
            - statusCode: 204

  # ---- Tokenisation ----

  - name: "Tokenise reading resource (default locale)"
    weight: 10
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Tokenise Target {{ $now }}"
            content: "Bonjour le monde. Ceci est un test de tokenisation pour le moteur de lecture LingQ. Les mots sont segmentés avec Intl.Segmenter selon la locale française."
            language: "fr"
          capture:
            - json: "$.id"
              as: "resource_id"
      - get:
          url: "/reading/resources/{{ resource_id }}/tokenise"
          expect:
            - statusCode: 200

  - name: "Tokenise reading resource (language override)"
    weight: 5
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Tokenise Override {{ $now }}"
            content: "¿Cómo estás? Esta es una prueba del motor de lectura LingQ con segmentación de palabras en español."
            language: "es"
          capture:
            - json: "$.id"
              as: "resource_id"
      - get:
          url: "/reading/resources/{{ resource_id }}/tokenise?lang=es"
          expect:
            - statusCode: 200

  # ---- Reading Progress ----

  - name: "Get reading progress"
    weight: 5
    flow:
      - get:
          url: "/reading/progress"
          expect:
            - statusCode: 200

  - name: "Record reading session"
    weight: 5
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Session Target {{ $now }}"
            content: "Reading session tracking test. The user reads this article and records a session."
            language: "en"
          capture:
            - json: "$.id"
              as: "resource_id"
      - post:
          url: "/reading/progress/session"
          json:
            resourceId: "{{ resource_id }}"
            wordsRead: 125
            durationSeconds: 300
          expect:
            - statusCode: 200
          afterResponse: "setProgress"
      - get:
          url: "/reading/progress"
          expect:
            - statusCode: 200

  # ---- Cache Administration ----

  - name: "Clear user reading caches"
    weight: 2
    flow:
      - delete:
          url: "/reading/cache/user"
          expect:
            - statusCode: 204

  # ---- Full workflow: create -> get -> tokenise -> record session -> progress ----

  - name: "Full reading engine workflow"
    weight: 3
    flow:
      - post:
          url: "/reading/resources"
          json:
            title: "Full Workflow Article {{ $now }}"
            content: "The LingQ reading engine provides an immersive way to learn languages through authentic content. Users can read articles, tap on words they do not know, see translations, and save vocabulary for spaced repetition review. The Intl.Segmenter API is used to tokenise text into clickable word tokens. Progress is tracked across reading sessions to measure fluency growth over time."
            language: "en"
            difficulty: "intermediate"
            topic: "technology"
          capture:
            - json: "$.id"
              as: "resource_id"
      - get:
          url: "/reading/resources/{{ resource_id }}"
      - get:
          url: "/reading/resources/{{ resource_id }}/tokenise"
      - post:
          url: "/reading/progress/session"
          json:
            resourceId: "{{ resource_id }}"
            wordsRead: 250
            durationSeconds: 600
      - get:
          url: "/reading/progress"